app/views/students/index.html.erb

SELECT "students"."created_at" FROM "students"
SELECT SUM("students"."created_at") AS sum_created_at, created_at AS created_at FROM "students" GROUP BY "students"."created_at"
---
<h1>Floor</h1>
<%= bar_chart Student.group(:floor).count %>

SELECT SUM("students"."seating") AS sum_seating, seating AS seating FROM "students" GROUP BY "students"."seating"
---
<h1>Seating</h1>
<%= bar_chart Student.group(:seating).count %>

SELECT COUNT(*) AS count_all, technology AS technology FROM "students" GROUP BY "students"."technology"
---
<h1>Technology</h1>
<%= bar_chart Student.group(:technology).count %>

SELECT COUNT(*) AS count_all, activity AS activity FROM "students" GROUP BY "students"."activity"
---
<h1>Activity</h1>
<%= bar_chart Student.group(:activity).count %>