app/controllers/students_controller.rb

    def index
        @students = Student.all
---
SELECT "students"."created_at" FROM "students"
SELECT SUM("students"."created_at") AS sum_created_at, created_at AS created_at FROM "students" GROUP BY "students"."created_at"